{
  "header": {
    "title": "pixel.me",
    "subtitle": "Transforme suas imagens em pixel art com um clique"
  },
  "upload": {
    "title": "Clique para selecionar uma imagem",
    "description": "PNG, JPG, WebP até 10MB • Suporte à transparência",
    "drop": "Solte suas imagens aqui",
    "dropDescription": "Solte para enviar",
    "invalidFiles": "Arquivo inválido: {{file}}. Apenas imagens são aceitas."
  },
  "settings": {
    "title": "Configurações",
    "reset": "Resetar",
    "newImage": "Nova Imagem",
    "pixelSize": "Tamanho do Pixel",
    "colorReduction": "Redução de Cores",
    "brightness": "Brilho",
    "contrast": "Contraste",
    "saturation": "Saturação",
    "dithering": "Dithering",
    "presets": "Presets",
    "tooltips": {
      "pixelSize": "Define o tamanho de cada 'bloco' de cor na imagem. Valores maiores criam um visual mais abstrato e retrô, enquanto valores menores retêm mais detalhes.",
      "colorReduction": "Limita o número total de cores na imagem final para criar um visual de videogame retrô (ex: 8-bit, 16-bit).",
      "brightness": "Ajusta o brilho geral da imagem. Aumente para clarear as cores e diminua para escurecê-las.",
      "contrast": "Aumenta ou diminui a diferença entre áreas claras e escuras. Um contraste mais alto torna as cores mais intensas e definidas.",
      "saturation": "Controla a 'pureza' ou intensidade das cores. Valores baixos deixam a imagem acinzentada (preto e branco), enquanto valores altos tornam as cores mais vivas.",
      "dithering": "Uma técnica de arte digital que usa padrões de pixels para simular tons intermediários e gradientes suaves, criando um visual clássico e nostálgico comum em jogos de consoles antigos."
    }
  },
  "results": {
    "originalImage": "Imagem Original",
    "pixelArt": "Pixel Art",
    "download": "Baixar",
    "processing": "Processando imagem..."
  },
  "footer": {
    "developedBy": "Desenvolvido por"
  },
  "errors": {
    "invalidFileType": "Opa! Por favor, selecione um arquivo de imagem válido (PNG, JPG, WebP).",
    "fileRead": "Não foi possível ler o arquivo. Por favor, tente selecioná-lo novamente.",
    "imageLoad": "Falha ao carregar a imagem. O arquivo pode estar corrompido ou em um formato não suportado. Por favor, tente outro.",
    "conversion": "Ocorreu um erro durante a conversão. Tente novamente ou ajuste as configurações."
  }
}
