{
  "header": {
    "title": "pixel.me",
    "subtitle": "Convierte tus imágenes en pixel art con un solo clic"
  },
  "upload": {
    "title": "Haz clic para seleccionar una imagen",
    "description": "PNG, JPG, WebP hasta 10MB • Transparencia admitida",
    "drop": "Suelta tus imágenes aquí",
    "dropDescription": "Suelta para subir",
    "invalidFiles": "Archivo no válido: {{file}}. Solo se aceptan imágenes."
  },
  "settings": {
    "title": "Ajustes",
    "reset": "Reiniciar",
    "newImage": "Nueva Imagen",
    "pixelSize": "Tamaño de Píxel",
    "colorReduction": "Reducción de Color",
    "brightness": "Brillo",
    "contrast": "Contraste",
    "saturation": "Saturación",
    "dithering": "Tramado",
    "presets": "Preajustes",
    "tooltips": {
      "pixelSize": "Define el tamaño de cada 'bloque' de color en la imagen. Valores más grandes crean un aspecto más abstracto y retro, mientras que valores más pequeños conservan más detalles.",
      "colorReduction": "Limita el número total de colores en la imagen final para crear un aspecto de videojuego retro (p. ej., 8 bits, 16 bits).",
      "brightness": "Ajusta el brillo general de la imagen. Aumenta para aclarar los colores y disminuye para oscurecerlos.",
      "contrast": "Aumenta o disminuye la diferencia entre las áreas claras y oscuras. Un mayor contraste hace que los colores sean más intensos y definidos.",
      "saturation": "Controla la 'pureza' o intensidad de los colores. Valores bajos hacen que la imagen sea grisácea (blanco y negro), mientras que valores altos hacen los colores más vivos.",
      "dithering": "Una técnica de arte digital que utiliza patrones de píxeles para simular tonos intermedios y gradientes suaves, creando un aspecto clásico y nostálgico común en los antiguos juegos de consola."
    }
  },
  "results": {
    "originalImage": "Imagen Original",
    "pixelArt": "Pixel Art",
    "download": "Descargar",
    "processing": "Procesando imagen..."
  },
  "footer": {
    "developedBy": "Desarrollado por"
  },
  "errors": {
    "invalidFileType": "¡Uy! Por favor, selecciona un archivo de imagen válido (PNG, JPG, WebP).",
    "fileRead": "No se pudo leer el archivo. Por favor, intenta seleccionarlo de nuevo.",
    "imageLoad": "No se pudo cargar la imagen. Podría estar corrupta o en un formato no compatible. Por favor, prueba con otra.",
    "conversion": "Ocurrió un error durante la conversión. Inténtalo de nuevo o ajusta la configuración."
  }
}
